TestingTool_3-0/src/InformationRegisters/ЗамерыПоказателей/ЗамерыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПоказателей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проверка</name>
    <type>
      <types>CatalogRef.Проверки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Показатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйПоказатель</name>
    <type>
      <types>CatalogRef.Показатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗамера</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/ЗамерыПоказателей/ManagerModule.bsl
Функция УстановитьЗначениеЗамераПоказателя(Знач ДатаЗамера, Знач ТестируемыйКлиент, Знач Показатель,Знач Значение, Знач ДополнительныйПоказатель=Неопределено, Знач ДополнительноеЗначение=Неопределено, Знач Проверка=Неопределено) Экспорт
	
	Попытка
		
		МенеджерЗаписи 							= РегистрыСведений.ЗамерыПоказателей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Проверка 				= Проверка;
		МенеджерЗаписи.ТестируемыйКлиент 		= ТестируемыйКлиент;
		МенеджерЗаписи.Показатель 				= Показатель;
		МенеджерЗаписи.ДополнительныйПоказатель = ДополнительныйПоказатель;
		МенеджерЗаписи.ДатаЗамера 				= ДатаЗамера;
		МенеджерЗаписи.Значение 				= Значение;
		МенеджерЗаписи.ДополнительноеЗначение 	= ДополнительноеЗначение;
		
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("ЗамерыПоказателей.УстановитьЗначениеЗамераПоказателя",УровеньЖурналаРегистрации.Ошибка,Неопределено,Неопределено,ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
